// 基于准备好的dom，初始化echarts实例
var myChart = echarts.init(document.getElementById('k-lines'));

var colorList = ['#c23531','#2f4554', '#61a0a8', '#d48265', '#91c7ae','#749f83',  '#ca8622', '#bda29a','#6e7074', '#546570', '#c4ccd3'];
var labelFont = 'bold 12px Sans-serif';

var dates = ["2016-03-29", "2016-03-30", "2016-03-31", "2016-04-01", "2016-04-04", "2016-04-05", "2016-04-06", "2016-04-07", "2016-04-08", "2016-04-11", "2016-04-12", "2016-04-13", "2016-04-14", "2016-04-15", "2016-04-18", "2016-04-19", "2016-04-20", "2016-04-21", "2016-04-22", "2016-04-25", "2016-04-26", "2016-04-27", "2016-04-28", "2016-04-29", "2016-05-02", "2016-05-03", "2016-05-04", "2016-05-05", "2016-05-06", "2016-05-09", "2016-05-10", "2016-05-11", "2016-05-12", "2016-05-13", "2016-05-16", "2016-05-17", "2016-05-18", "2016-05-19", "2016-05-20", "2016-05-23", "2016-05-24", "2016-05-25", "2016-05-26", "2016-05-27", "2016-05-31", "2016-06-01", "2016-06-02", "2016-06-03", "2016-06-06", "2016-06-07", "2016-06-08", "2016-06-09", "2016-06-10", "2016-06-13", "2016-06-14", "2016-06-15", "2016-06-16", "2016-06-17", "2016-06-20", "2016-06-21", "2016-06-22"];
var data = [[17512.58,17633.11,17434.27,17642.81,86160000],[17652.36,17716.66,17652.36,17790.11,79330000],[17716.05,17685.09,17669.72,17755.7,102600000],[17661.74,17792.75,17568.02,17811.48,104890000],[17799.39,17737,17710.67,17806.38,85230000],[17718.03,17603.32,17579.56,17718.03,115230000],[17605.45,17716.05,17542.54,17723.55,99410000],[17687.28,17541.96,17484.23,17687.28,90120000],[17555.39,17576.96,17528.16,17694.51,79990000],[17586.48,17556.41,17555.9,17731.63,107100000],[17571.34,17721.25,17553.57,17744.43,81020000],[17741.66,17908.28,17741.66,17918.35,91710000],[17912.25,17926.43,17885.44,17962.14,84510000],[17925.95,17897.46,17867.41,17937.65,118160000],[17890.2,18004.16,17848.22,18009.53,89390000],[18012.1,18053.6,17984.43,18103.46,89820000],[18059.49,18096.27,18031.21,18167.63,100210000],[18092.84,17982.52,17963.89,18107.29,102720000],[17985.05,18003.75,17909.89,18026.85,134120000],[17990.94,17977.24,17855.55,17990.94,83770000],[17987.38,17990.32,17934.17,18043.77,92570000],[17996.14,18041.55,17920.26,18084.66,109090000],[18023.88,17830.76,17796.55,18035.73,100920000],[17813.09,17773.64,17651.98,17814.83,136670000],[17783.78,17891.16,17773.71,17912.35,80100000],[17870.75,17750.91,17670.88,17870.75,97060000],[17735.02,17651.26,17609.01,17738.06,95020000],[17664.48,17660.71,17615.82,17736.11,81530000],[17650.3,17740.63,17580.38,17744.54,80020000],[17743.85,17705.91,17668.38,17783.16,85590000],[17726.66,17928.35,17726.66,17934.61,75790000],[17919.03,17711.12,17711.05,17919.03,87390000],[17711.12,17720.5,17625.38,17798.19,88560000],[17711.12,17535.32,17512.48,17734.74,86640000],[17531.76,17710.71,17531.76,17755.8,88440000],[17701.46,17529.98,17469.92,17701.46,103260000],[17501.28,17526.62,17418.21,17636.22,79120000],[17514.16,17435.4,17331.07,17514.16,95530000],[17437.32,17500.94,17437.32,17571.75,111990000],[17507.04,17492.93,17480.05,17550.7,87790000],[17525.19,17706.05,17525.19,17742.59,86480000],[17735.09,17851.51,17735.09,17891.71,79180000],[17859.52,17828.29,17803.82,17888.66,68940000],[17826.85,17873.22,17824.73,17873.22,73190000],[17891.5,17787.2,17724.03,17899.24,147390000],[17754.55,17789.67,17664.79,17809.18,78530000],[17789.05,17838.56,17703.55,17838.56,75560000],[17799.8,17807.06,17689.68,17833.17,82270000],[17825.69,17920.33,17822.81,17949.68,71870000],[17936.22,17938.28,17936.22,18003.23,78750000],[17931.91,18005.05,17931.91,18016,71260000],[17969.98,17985.19,17915.88,18005.22,69690000],[17938.82,17865.34,17812.34,17938.82,90540000],[17830.5,17732.48,17731.35,17893.28,101690000],[17710.77,17674.82,17595.79,17733.92,93740000],[17703.65,17640.17,17629.01,17762.96,94130000],[17602.23,17733.1,17471.29,17754.91,91950000],[17733.44,17675.16,17602.78,17733.44,248680000],[17736.87,17804.87,17736.87,17946.36,99380000],[17827.33,17829.73,17799.8,17877.84,85130000],[17832.67,17780.83,17770.36,17920.16,89440000]];
var volumes = [86160000,79330000,102600000,104890000,85230000,115230000,99410000,90120000,79990000,107100000,81020000,91710000,84510000,118160000,89390000,89820000,100210000,102720000,134120000,83770000,92570000,109090000,100920000,136670000,80100000,97060000,95020000,81530000,80020000,85590000,75790000,87390000,88560000,86640000,88440000,103260000,79120000,95530000,111990000,87790000,86480000,79180000,68940000,73190000,147390000,78530000,75560000,82270000,71870000,78750000,71260000,69690000,90540000,101690000,93740000,94130000,91950000,248680000,99380000,85130000,89440000];


function calculateMA(dayCount, data) {
    var result = [];
    for (var i = 0, len = data.length; i < len; i++) {
        if (i < dayCount) {
            result.push('-');
            continue;
        }
        var sum = 0;
        for (var j = 0; j < dayCount; j++) {
            sum += data[i - j][1];
        }
        result.push((sum / dayCount).toFixed(2));
    }
    return result;
}

var dataMA5 = calculateMA(5, data);
var dataMA10 = calculateMA(10, data);
var dataMA20 = calculateMA(20, data);



// 指定图表的配置项和数据
var option = {
    
    // 图片标题:
    title: {
        left: 'center',  // 居中显示
        text: 'K线图'    // 标题内容
    },

    // 图例组件:
    // 图中可能显示多种类型的数据
    legend: {
        top: 30,
        data: ['日K', 'MA5', 'MA10', 'MA20', 'MA30']
    },

    // 坐标轴指示器：
    // 一张图中可能有多个子图，这里设置子图的x坐标轴
    axisPointer: {
        // 设置坐标轴的联动：
        // link的值是一个数组, 数组中没一个值{..}是一个group
        // 每个group是联动的坐标轴
        link: [{
            xAxisIndex: [0, 1]
        }]
    },

    // 数据缩放组件：有缩放条和缩放按钮的那个
    // dataZoom是数组，里面每一项都是一个缩放控件
    dataZoom: [{
        type: 'slider',      // 有一个滚动条
        xAxisIndex: [0, 1],  // 控制两个x轴
        realtime: true,      // 不是实时
        start: 20,           // 离起始位置的百分比
        end: 70,             // 离起始位置的百分比
        top: 65,             // 离整个dom上侧的距离，单位px
        height: 20,          // 缩放条的高度
        handleIcon: 'M10.7,11.9H9.3c-4.9,0.3-8.8,4.4-8.8,9.4c0,5,3.9,9.1,8.8,9.4h1.3c4.9-0.3,8.8-4.4,8.8-9.4C19.5,16.3,15.6,12.2,10.7,11.9z M13.3,24.4H6.7V23h6.6V24.4z M13.3,19.6H6.7v-1.4h6.6V19.6z',
                             // 缩放按钮的图形样式
        handleSize: '100%'   // 缩放按钮的大小百分比
    }, {
        type: 'inside',      // 在数据区域内通过滚轮控制
        xAxisIndex: [0, 1],  // 控制两个x轴
        start: 40,           // 离起始位置的百分比 
        end: 70              // 离起始位置的百分比        
    }],

    // x轴样式和数据设置：
    // 是一个数组，每一项是每一个x轴的数据，通过gridIndex指示是哪个坐标轴
    // gridIndex默认是0
    xAxis: [{
        type: 'category',    // 类目轴，用于离散数值
        data: dates,         // 坐标轴具体数值
        boundaryGap : false, // 数据在刻度之间显示true，数据在刻度上显示false
        axisLine: { lineStyle: { color: '#777' } },
                             // 坐标轴样式设置
        // 坐标轴标签设置
        axisLabel: {
            formatter: function (value) {
                return echarts.format.formatTime('MM-dd', value);
            }
        },
        min: 'dataMin',      // 取最小值作为最小刻度
        max: 'dataMax',      // 取最大值作为最大刻度
        // 坐标轴指示器设置
        axisPointer: {
            show: true       // 是否显示该坐标轴指示器
        }
    }, {
        type: 'category',    // 类目轴，用于离散数值
        gridIndex: 1,        // 指示是1号x轴
        data: dates,         // 配置数据
        scale: true,         // 设置为true以后不会强行包含0刻度
        boundaryGap : false, // 数据在刻度之间显示true，数据在刻度上显示false
        splitLine: {show: false}, // 分割线样式
        axisLabel: {show: false}, // 刻度标签样式
        axisTick: {show: false},  // 刻度样式
        axisLine: { lineStyle: { color: '#777' } }, //坐标轴线的样式
        splitNumber: 20,     // 分割段数，根据实际情况调整
        min: 'dataMin',      // 取最小值作为最小刻度
        max: 'dataMax',      // 取最大值作为最大刻度
        axisPointer: {
            type: 'shadow',  // 阴影样式，非刻度样式
            label: {show: false}, // 显示指示器标签
            triggerTooltip: true, // 是否触发tooltp
            // 设置拖拽手柄，适用于触屏的情形
            handle: {
                show: true,
                margin: 30,
                color: '#B80C00'
            }
        }
    }],

    // y轴样式设置（注意，
    // 这里还没有填充y轴的数据, y轴数据通过series来填充）：
    yAxis: [{
        scale: true,        // 是否脱离包含0刻度
        splitNumber: 2,     // 分割段数，根据实际情况调整
        axisLine: { lineStyle: { color: '#777' } }, // 坐标轴线样式
        splitLine: { show: true },  // 是否显示分割线
        axisTick: { show: false },  // 是否显示刻度
        // 标签设置
        axisLabel: {
            inside: true,    // 内部显示
            formatter: '{value}\n'
        }
    }, {
        scale: true,
        gridIndex: 1,
        splitNumber: 2,
        axisLabel: {show: false},
        axisLine: {show: false},
        axisTick: {show: false},
        splitLine: {show: false}
    }],

    // 不同坐标系的样式设置
    grid: [{
        left: 20,
        right: 20,
        top: 110,
        height: 120
    }, {
        left: 20,
        right: 20,
        height: 40,
        top: 260
    }],

    // 定义图形元素
    graphic: [{
        type: 'group',       // 用来定义一组图形元素
        left: 'center',      // 描述怎么根据父元素进行定位。父元素是指：如果是顶层元素，父元素是 echarts 图表容器。
                             // 如果是 group 的子元素，父元素就是 group 元素。
        top: 70,
        width: 300,
        bounding: 'raw',     // 显示时可能会超出父元素
        children: [{
            id: 'MA5',
            type: 'text',
            style: {fill: colorList[1], font: labelFont},
            left: 0
        }, {
            id: 'MA10',
            type: 'text',
            style: {fill: colorList[2], font: labelFont},
            left: 'center'
        }, {
            id: 'MA20',
            type: 'text',
            style: {fill: colorList[3], font: labelFont},
            right: 0
        }]
    }],

    // 设置数据系列，就是具体在图中显示的数据
    // 是数组，每一项的数据通过xAxisIndex和yAxisIndex来指示在
    // 哪个坐标轴显示
    series: [{
        name: 'Volume',
        type: 'bar',         // 柱状图
        xAxisIndex: 1,
        yAxisIndex: 1,
        // 每一个数据项的样式设置
        itemStyle: {
            normal: {
                color: '#7fbe9e'
            },
            emphasis: {
                color: '#140'
            }
        },
        data: volumes
    }, {
        type: 'candlestick',
        name: '日K',
        data: data,
        itemStyle: {
            normal: {
                color: '#ef232a',
                color0: '#14b143',
                borderColor: '#ef232a',
                borderColor0: '#14b143'
            },
            emphasis: {
                color: 'black',
                color0: '#444',
                borderColor: 'black',
                borderColor0: '#444'
            }
        }
    }, {
        name: 'MA5',
        type: 'line',
        data: dataMA5,
        smooth: true,
        showSymbol: false,
        lineStyle: {
            normal: {
                width: 1
            }
        }
    }, {
        name: 'MA10',
        type: 'line',
        data: dataMA10,
        smooth: true,
        showSymbol: false,
        lineStyle: {
            normal: {
                width: 1
            }
        }
    }, {
        name: 'MA20',
        type: 'line',
        data: dataMA20,
        smooth: true,
        showSymbol: false,
        lineStyle: {
            normal: {
                width: 1
            }
        }
    }],

    // 设置提示组件：
    // 鼠标悬浮上去的时候会显示相关提示信息
    tooltip: {
        triggerOn: 'none',        // 提示框被触发的条件
        transitionDuration: 0,    // 提示框的过度时间
        confine: true,            // 是否将 tooltip 框限制在图表的区域内
        bordeRadius: 4,           // 提示框边框圆角
        borderWidth: 1,           // 提示框边框粗细
        borderColor: '#333',      // 提示框边框颜色
        backgroundColor: 'rgba(255,255,255,0.9)', // 提示框背景色
        textStyle: {
            fontSize: 12,         // 提示框字体大小
            color: '#333'         // 提示框字体颜色
        },
        position: function (pos, params, el, elRect, size) {
            var obj = {
                top: 60
            };
            obj[['left', 'right'][+(pos[0] < size.viewSize[0] / 2)]] = 5;
            return obj;
        }
    },
};


// 使用刚指定的配置项和数据显示图表。
myChart.setOption(option);